app/controllers/v1/items_controller.rb

  def create
    @todo.items.create!(item_params)
---
INSERT INTO "items" ("name", "todo_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Listen to Don Giovanni"], ["todo_id", 1], ["created_at", "2018-01-05 08:43:22.418412"], ["updated_at", "2018-01-05 08:43:22.418412"]]

  def set_todo_item
    @item = @todo.items.find_by!(id: params[:id]) if @todo
---
SELECT "items".* FROM "items" WHERE "items"."todo_id" = ?  [["todo_id", 1]]