app/controllers/items_controller.rb

INSERT INTO "items" ("name", "done", "todo_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Listen to 5th Symphony"], ["done", "f"], ["todo_id", 2], ["created_at", "2017-12-31 04:04:56.027238"], ["updated_at", "2017-12-31 04:04:56.027238"]]
---
 def create
   @todo.items.create!(item_params)

UPDATE "items" SET "name" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["name", "Mozart"], ["updated_at", "2017-12-30 18:43:46.940013"], ["id", 1]]
---
 def update
   @item.update(item_params)