app/controllers/todos_controller.rb

 def create
   @todo = Todo.create!(todo_params)
---
INSERT INTO "todos" ("title", "created_by", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Mozart"], ["created_by", "1"], ["created_at", "2017-12-30 18:00:35.159068"], ["updated_at", "2017-12-30 18:00:35.159068"]]